src/main/test/supply-chain/0-Validation/0-Apply Tax/0-01_01_01_General_Validations/3-TC01.01.01.04_TaxAlgorithmDate_TaxCalculationDate_validation/3-TC01.01.01.04_TaxAlgorithmDate_TaxCalculationDate_validation-4/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax>
         <arg0>
            <DocumentId>
               <SystemSourceId>ICI001</SystemSourceId>
               <TransactionId/>
            </DocumentId>
            <AlternateDocumentId>
               <CustomField1>35452_646127</CustomField1>
               <CustomField2>930-CDC-G11038474</CustomField2>
               <CustomField3/>
               <CustomField4/>
               <CustomField5/>
               <CustomField6/>
               <CustomField7/>
               <CustomField8/>
               <CustomField9/>
               <CustomField10/>
            </AlternateDocumentId>
            <InvoiceLanguage>
               <LanguageCode>en</LanguageCode>
               <LanguageCountryCode>GB</LanguageCountryCode>
            </InvoiceLanguage>
            <CommunicationLanguage>
               <LanguageCode>en</LanguageCode>
               <LanguageCountryCode>GB</LanguageCountryCode>
            </CommunicationLanguage>
            <GrossPriceCalculation/>
            <CalculationDecimalPlaces>2</CalculationDecimalPlaces>
            <PreviousInvoiceTaxCountry/>
            <TaxDecisionSet>
               <TaxDecisionSetId/>
               <SellerTaxIndicator>
                  <TaxIndicatorAbbreviation/>
                  <TaxIndicatorName/>
                  <TaxIndicatorComment/>
               </SellerTaxIndicator>
               <SellerTaxCountry/>
               <SellerTaxState/>
               <BuyerTaxIndicator>
                  <TaxIndicatorAbbreviation/>
                  <TaxIndicatorName/>
                  <TaxIndicatorComment/>
               </BuyerTaxIndicator>
               <BuyerTaxCountry/>
               <BuyerTaxState/>
               <CombinedTaxIndicator/>
               <CommercialIndicator/>
               <SellerTaxRegCountry/>
               <SellerTaxRegState/>
               <BuyerTaxRegCountry/>
               <BuyerTaxRegState/>
               <GrossPriceCountry/>
              
               
               <TaxComment>
                  <TaxCommentType/>
                  <TaxCommentText/>
               </TaxComment>
               <InvoiceCurrency>
                  <CurrencyCode>CAD</CurrencyCode>
                  <SellerLocalTaxCurrencyCode/>
                  <BuyerLocalTaxCurrencyCode/>
               </InvoiceCurrency>
               <LegalTaxCalculationLevel/>
               <TaxInvoiceLine>
                  <LineNumber>1</LineNumber>
                  <ItemNo>1</ItemNo>
                  <ItemType/>
                  <UNSPSC>58000000</UNSPSC>
                  <Classification/>
                  <SubClassification/>
                  <CountryItemClassification/>
                  <NetAmount>100</NetAmount>
                 
                  <VariableTaxSteeringInput>
                     <ConsignorCountry>CA</ConsignorCountry>
                     <ConsignorState>CAQC</ConsignorState>
                     <ConsignorBusinessUnitCode>930</ConsignorBusinessUnitCode>
                     <ConsignorBusinessUnitType>CDC</ConsignorBusinessUnitType>
                     <ConsigneeCountry>CA</ConsigneeCountry>
                     <ConsigneeState>CASK</ConsigneeState>
                     <ConsigneeBusinessUnitCode>822</ConsigneeBusinessUnitCode>
                     <ConsigneeBusinessUnitType>LSC</ConsigneeBusinessUnitType>
                     <CarrierCountry/>
                     <CarrierState/>
                     <CarrierBusinessUnitCode>40112</CarrierBusinessUnitCode>
                     <CarrierBusinessUnitType>CAR</CarrierBusinessUnitType>
                     <ShipmentStartCountry>CA</ShipmentStartCountry>
                     <ShipmentEndCountry>CA</ShipmentEndCountry>
                     <ShipmentStartState>CAQC</ShipmentStartState>
                     <ShipmentEndState>CASK</ShipmentEndState>
                     <ServiceRenderedCountry/>
                     <ServiceRenderedState/>
                     <ResalePurpose/>
                     <IsOutBonded/>
                     <IsInBonded/>
                     <TaxPreAlgorithmOutput>
                        <IsExport>Y</IsExport>
                        <IsImport>N</IsImport>
                        <IsExported>N</IsExported>
                        <IsImported>N</IsImported>
                     </TaxPreAlgorithmOutput>
                     <ShippingOfCustomsClearedGoods/>
                  </VariableTaxSteeringInput>
               </TaxInvoiceLine>
               <SellerTaxInformation>
                  <TaxRegistration>
                     <TaxRegistrationCountry/>
                     <TaxRegistrationNumberType/>
                     <TaxRegistrationNumber/>
                     <TaxRegistrationState/>
                     <TaxRegistrationNumberStateType/>
                     <TaxRegistrationNumberState/>
                  </TaxRegistration>
                  <TaxRepresentative>
                     <TaxParty>
                        <TaxRepresentativeCode/>
                        <TaxRepresentativeType/>
                        <BusinessUnitCode/>
                        <BusinessUnitType/>
                        <BusinessUnitName/>
                     </TaxParty>
                     <TaxRegistration>
                        <TaxRegistrationCountry/>
                        <TaxRegistrationNumberType/>
                        <TaxRegistrationNumber/>
                        <TaxRegistrationState/>
                        <TaxRegistrationNumberStateType/>
                        <TaxRegistrationNumberState/>
                     </TaxRegistration>
                     <PartyAddress>
                        <AddressType/>
                        <City/>
                        <PostBox/>
                        <Street/>
                        <ZipCode/>
                        <CountryCode/>
                        <StateCode/>
                        <CountryOfLegalRegistration/>
                     </PartyAddress>
                  </TaxRepresentative>
               </SellerTaxInformation>
               <BuyerTaxInformation>
                  <TaxRegistration>
                     <TaxRegistrationCountry/>
                     <TaxRegistrationNumberType/>
                     <TaxRegistrationNumber/>
                     <TaxRegistrationState/>
                     <TaxRegistrationNumberStateType/>
                     <TaxRegistrationNumberState/>
                  </TaxRegistration>
                  <TaxRepresentative>
                     <TaxParty>
                        <TaxRepresentativeCode/>
                        <TaxRepresentativeType/>
                        <BusinessUnitCode/>
                        <BusinessUnitType/>
                        <BusinessUnitName/>
                     </TaxParty>
                     <TaxRegistration>
                        <TaxRegistrationCountry/>
                        <TaxRegistrationNumberType/>
                        <TaxRegistrationNumber/>
                        <TaxRegistrationState/>
                        <TaxRegistrationNumberStateType/>
                        <TaxRegistrationNumberState/>
                     </TaxRegistration>
                     <PartyAddress>
                        <AddressType/>
                        <City/>
                        <PostBox/>
                        <Street/>
                        <ZipCode/>
                        <CountryCode/>
                        <StateCode/>
                        <CountryOfLegalRegistration/>
                     </PartyAddress>
                  </TaxRepresentative>
               </BuyerTaxInformation>
            </TaxDecisionSet>
            <TaxDate>
               <TaxAlgorithmDate>${#TestSuite#TaxAlgoDate+2}</TaxAlgorithmDate>
               <TaxCalculationDate>2016-01-10</TaxCalculationDate>
            </TaxDate>
            <TaxModuleBehaviour>
               <SkipCalculation>N</SkipCalculation>
               <SkipDecision>N</SkipDecision>
            </TaxModuleBehaviour>
            <VariableTaxSteeringInput>
               <ConsignorCountry>CA</ConsignorCountry>
               <ConsignorState>CAQC</ConsignorState>
               <ConsignorBusinessUnitCode>930</ConsignorBusinessUnitCode>
               <ConsignorBusinessUnitType>CDC</ConsignorBusinessUnitType>
               <ConsigneeCountry>CA</ConsigneeCountry>
               <ConsigneeState>CASK</ConsigneeState>
               <ConsigneeBusinessUnitCode>822</ConsigneeBusinessUnitCode>
               <ConsigneeBusinessUnitType>LSC</ConsigneeBusinessUnitType>
               <CarrierCountry/>
               <CarrierState/>
               <CarrierBusinessUnitCode>40112</CarrierBusinessUnitCode>
               <CarrierBusinessUnitType>CAR</CarrierBusinessUnitType>
               <ShipmentStartCountry>CA</ShipmentStartCountry>
               <ShipmentEndCountry>CA</ShipmentEndCountry>
               <ShipmentStartState>CAQC</ShipmentStartState>
               <ShipmentEndState>CASK</ShipmentEndState>
               <ServiceRenderedCountry/>
               <ServiceRenderedState/>
               <ResalePurpose/>
               <IsOutBonded/>
               <IsInBonded/>
               <TaxPreAlgorithmOutput>
                  <IsExport/>
                  <IsImport/>
                  <IsExported/>
                  <IsImported/>
               </TaxPreAlgorithmOutput>
               <ShippingOfCustomsClearedGoods>Y</ShippingOfCustomsClearedGoods>
            </VariableTaxSteeringInput>
            <BuyerParty>
               <Party>
                  <BusinessUnitCode>5100</BusinessUnitCode>
                  <BusinessUnitType>COM</BusinessUnitType>
                  <BusinessUnitName/>
                  <PartyAddress>
                     <AddressType/>
                     <City/>
                     <PostBox/>
                     <Street/>
                     <ZipCode/>
                     <CountryCode/>
                     <StateCode/>
                     <CountryOfLegalRegistration/>
                  </PartyAddress>
               </Party>
               <CustomerID/>
            </BuyerParty>
            <SellerParty>
               <Party>
                  <BusinessUnitCode>40112</BusinessUnitCode>
                  <BusinessUnitType>CAR</BusinessUnitType>
                  <BusinessUnitName/>
                  <PartyAddress>
                     <AddressType/>
                     <City/>
                     <PostBox/>
                     <Street/>
                     <ZipCode/>
                     <CountryCode/>
                     <StateCode/>
                     <CountryOfLegalRegistration/>
                  </PartyAddress>
               </Party>
            </SellerParty>
            <TermOfDelivery/>
            <Error>
               <ErrorCode/>
               <ErrorType/>
               <ErrorText/>
            </Error>
         </arg0>
      </ws:applyTax>
   </soap:Body>
</soap:Envelope>